#include <stdio.h>
int main()
{
	//指针遍历第二种格式的二维数组

	int arr1[5] = { 1,2,3,4,5 };
	int arr2[5] = { 11,22,33,44,55 };
	int arr3[5] = { 111,222,333,444,555 };

	//把三个一维数组的内存地址存放到二维数组中
	int* arr[3] = { arr1,arr2,arr3 };

	//获取指针
	//两个*的不同含义：
		//第一个*表示arr数组中存放的是3个一维数组的内存地址
		//第二个*是指针标记
	int** p = arr;

	//指针遍历
	for (int i = 0; i < 3; i++)
	{
		//遍历一维数组
		for (int j = 0; j < 5; j++)
		{
			printf("%d ", *(*p + j));
		}
		printf("\n");
		//移动二维数组的指针，继续遍历下一个一维数组
		p++;
	}
	return 0;
}